УТ_для_edt/src/Documents/CRM_Заявка/CRM_Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_Заявка</name>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UTMМетка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПервичногоИнтереса</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПервичногоИнтереса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <comment>0 - Заявка, 1 - Звонок</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартБизнесРегион</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>смартКвалификация</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>CatalogRef.смартКвалификацииМенеджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСостояниеЛида</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>EnumRef.смартСостоянияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>смартПродукт</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартРезультатыПоискаПоКИ</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>смартБизнесРегионТекст</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартТипТовара</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартYclid_Метка</name>
    <comment>//++ #1941 смарт: Фролов 22.07.2024 //Добавить реквизит &quot;yclid&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартClientID</name>
    <comment>#1958 смарт: Лопато 05.08.2024 //Добавить реквизит &quot;ClientID&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/ИсточникиПервичногоИнтереса/ИсточникиПервичногоИнтереса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсточникиПервичногоИнтереса</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КаналПервичногоИнтереса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникПервичногоИнтереса</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>CRM_Сайт</name>
    <type>
      <types>CatalogRef.CRM_Сайты</types>
    </type>
  </resources>
  <resources>
    <name>CRM_UTM_source</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CRM_UTM_medium</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CRM_UTM_pos</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.УдалитьCRM_Сделка</types>
      <types>CatalogRef.СделкиСКлиентами</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.CRM_СостоянияЛидов</types>
    </type>
  </resources>
  <resources>
    <name>СконвертированВОбъект</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанСКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКанала</name>
    <type>
      <types>EnumRef.CRM_ВидыКаналовПоступленияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработку</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтказаПоИнтересам</types>
    </type>
  </attributes>
  <dimensions>
    <name>Лид</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>CatalogRef.CRM_Диалоги</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <predefined>
    <items>
      <name>Новый</name>
      <description>Новое</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонено</description>
    </items>
    <items>
      <name>Повторный</name>
      <description>Повторное</description>
    </items>
    <items>
      <name>ПовторныйОбработанный</name>
      <description>Повторное (обработанное)</description>
    </items>
    <items>
      <name>Сконвертирован</name>
      <description>Сконвертировано</description>
    </items>
  </predefined>
</mdclass:Catalog>

УТ_для_edt/src/Documents/CRM_Заявка/Forms/ФормаДокументаНовая/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.Свойство("ИсточникПолучения") Тогда
			Объект.ИсточникПолучения = Параметры.ИсточникПолучения;
			ИсточникПолученияПриИзмененииНаСервере();
		КонецЕсли;	
		Если Параметры.Свойство("Мероприятие") Тогда
			Объект.ДокументОснование = Параметры.Мероприятие;
			Объект.Тема = Объект.ДокументОснование.Наименование;
		КонецЕсли;	
		Если Параметры.Свойство("Контакт") Тогда
			Объект.Контакт = Параметры.Контакт;
			Объект.Наименование = Объект.Контакт.Наименование;
			Стр = Объект.Контакт.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.Телефон,"Тип");
			Если Стр <> Неопределено Тогда
				Объект.Телефон = Стр.Представление;
			КонецЕсли;	
			Стр = Объект.Контакт.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,"Тип");
			Если Стр <> Неопределено Тогда
				Объект.ЭлектроннаяПочта = Стр.Представление;;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
	// Лиды
	НаборСвойствНастроекЭлементовСостоянияОбращения = Новый Массив;
	НаборСвойствНастроекЭлементовСостоянияОбращения.Добавить("Видимость");
	НаборСвойствНастроекЭлементовСостоянияОбращения.Добавить("Доступность");
	АдресНастройкиЭлементовСостоянияОбращения = CRM_МетодыФормДокументовСервер.СохранитьНастройкиЭлементовСостоянияОбращения(ЭтаФорма,
																															МассивЭлементовСостоянияОбращения(),
																															НаборСвойствНастроекЭлементовСостоянияОбращения);
	ОбновитьСостояниеОбращения();
	
	
	CRM_МетодыФормДокументовСервер.СоздатьНеобходимыеРеквизитыИЭлементыДляГруппыИнтерес(ЭтотОбъект, "ГруппаИнтерес");

	Если Объект.ДополнительныеРеквизиты.Количество() = 0 Тогда
		Элементы.ДополнительныеРеквизиты.Видимость = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.CRM_РольОтветственного) И Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Элементы.Ответственный.Видимость = Ложь;
		Элементы.CRM_РольОтветственного.Видимость = Истина;
	КонецЕсли;

	Если ТипЗнч(Объект.Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		Если ЗначениеЗаполнено(Объект.Контакт) Тогда
			КонтактВладелец = Объект.Контакт.Владелец;
			Элементы.КонтактВладелец.Видимость = Истина;
		КонецЕсли;		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Контакт) Тогда		
		Объект.Контакт = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
	КонецЕсли;
	
	Элементы.СоздатьКонтакт.Видимость = Не ЗначениеЗаполнено(Объект.Контакт);
	
	Если ЗначениеЗаполнено(Объект.Контакт) И
		(ТипЗнч(Объект.Контакт) = Тип("СправочникСсылка.Партнеры") ИЛИ ТипЗнч(Объект.Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров")) Тогда
		ОтображатьКаналИсточник = Истина;
		Элементы.ГруппаПервичныйИнтерес.Видимость = ОтображатьКаналИсточник;
		Партнер = ?(ТипЗнч(Объект.Контакт) = Тип("СправочникСсылка.Партнеры"), Объект.Контакт, Объект.Контакт.Владелец);
	КонецЕсли;
	СформироватьОписаниеКаналаИсточника();
	НеобходимыеДействияПриСозданииНаСервереЧтенииНаСервере();
	ЗаполнятьПервичныйИнтерес = Константы.CRM_ЗаполнятьПервичныйИнтерес.Получить();
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Элементы.РанееЗарегистрированныйИнтерес.Видимость = Ложь;
	КонецЕсли;

	Элементы.ГруппаСостояниеЛида.Видимость = Ложь;
	
	// Выведем Звонок, введенный "на основании" данной заявки
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
		                |	ТелефонныйЗвонок.Ссылка КАК Ссылка
		                |ИЗ
		                |	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
		                |ГДЕ
		                |	ТелефонныйЗвонок.ВзаимодействиеОснование = &Заявка";
		
		Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Выборка.Следующий() Тогда
			ВведенныйЗвонок = Выборка.Ссылка;
			Элементы.ВведенныйЗвонок.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
// Процедура - обработчик события формы "ПриЧтенииНаСервере".
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
		МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	CRM_СобытияФорм.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьАРМ");
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеОбязательныхПолей()
	ТекстСообщения = "";
	ЕстьОшибки = Ложь;
	Если Объект.ИсточникПолучения.ТелефонОбязательно И НЕ ЗначениеЗаполнено(Объект.Телефон) Тогда
		ТекстСообщения = "Не заполнено обязательное поле 'Телефон'";
		ЕстьОшибки = Истина;
	КонецЕсли;	
	Если Объект.ИсточникПолучения.НаименованиеОбязательно И НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		ТекстСообщения = ?(ТекстСообщения = "", "", ТекстСообщения+"
		|") + "Не заполнено обязательное поле 'ФИО'";
		ЕстьОшибки = Истина;
	КонецЕсли;
	Если Объект.ИсточникПолучения.ПочтаОбязательно И НЕ ЗначениеЗаполнено(Объект.ЭлектроннаяПочта) Тогда
		ТекстСообщения = ?(ТекстСообщения = "", "", ТекстСообщения+"
		|") + "Не заполнено обязательное поле 'Электронная почта'";
		ЕстьОшибки = Истина;
	КонецЕсли;
	Для Каждого Строка Из Объект.ИсточникПолучения.ДополнительныеРеквизиты Цикл
		Если Строка.Обязательно Тогда
			СтруктураОтбора = Новый Структура("Свойство", Строка.Свойство);
			Стр = Объект.ДополнительныеРеквизиты.НайтиСтроки(СтруктураОтбора);
			Если Стр.Количество() = 0 Тогда
				ТекстСообщения = ?(ТекстСообщения = "", "", ТекстСообщения+"
				|") + "Не заполнен обязательный доп. реквизит '"+Строка.Свойство.Наименование+"'";
				ЕстьОшибки = Истина;
			ИначеЕсли НЕ ЗначениеЗаполнено(Стр[0].Значение) Тогда
				ТекстСообщения = ?(ТекстСообщения = "", "", ТекстСообщения+"
				|") + "Не заполнен обязательный доп. реквизит '"+Строка.Свойство.Наименование+"'";
				ЕстьОшибки = Истина;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	Если ЕстьОшибки Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецЕсли;	
	Возврат ЕстьОшибки;
КонецФункции	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = ПроверитьЗаполнениеОбязательныхПолей();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьСервисРаспознаванияЛиц") И ТипЗнч(ТекущийОбъект.Контакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		Об = ТекущийОбъект.Контакт.ПолучитьОбъект();
		Об.Наименование = ТекущийОбъект.Наименование;
		Об.Организация = ТекущийОбъект.Организация;
		
		Стр = Об.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.Телефон,"Тип");
		Если Стр = Неопределено Тогда
			Стр = Об.КонтактнаяИнформация.Добавить();
		КонецЕсли;	
		Стр.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		Стр.Вид = Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента;
		Стр.Представление = ТекущийОбъект.Телефон;
		Стр.НомерТелефона = ТекущийОбъект.Телефон;
		
		Стр = Об.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,"Тип");
		Если Стр = Неопределено Тогда
			Стр = Об.КонтактнаяИнформация.Добавить();
		КонецЕсли;	
		Стр.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		Стр.Вид = Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента;
		Стр.АдресЭП = ТекущийОбъект.ЭлектроннаяПочта;
		Стр.Представление = ТекущийОбъект.ЭлектроннаяПочта;
		Об.Записать();
	КонецЕсли;
	
	ОбновитьСостояниеОбращения();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
		пПартнер = Объект.Контакт;
		
		Если ЗначениеЗаполнено(Объект.Контакт) Тогда
			Если ТипЗнч(Объект.Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				пПартнер = Объект.Контакт.Владелец;
			КонецЕсли;
		КонецЕсли;	
		
		НаборЗаписей = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сделка.Установить(ТекущийОбъект.Ссылка);
		
		Если ЗначениеЗаполнено(ТекущийОбъект.КаналПервичногоИнтереса) Тогда
			Если (НЕ ЗначениеЗаполнено(ТекущийОбъект.ИсточникПервичногоИнтереса) 
				И ТипЗнч(ТекущийОбъект.КаналПервичногоИнтереса.ТипЗначения.ПривестиЗначение()) 
				= Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника"))
				ИЛИ ЗначениеЗаполнено(ТекущийОбъект.ИсточникПервичногоИнтереса) Тогда
				Если ЗначениеЗаполнено(пПартнер) Тогда
					Запрос = Новый Запрос("
					|ВЫБРАТЬ Период
					|ИЗ РегистрСведений.ИсточникиПервичногоИнтереса
					|ГДЕ Сделка = &Сделка И Партнер = &Партнер");
					Запрос.УстановитьПараметр("Сделка", ТекущийОбъект.Ссылка);
					Запрос.УстановитьПараметр("Партнер", пПартнер);
					
					Выборка = Запрос.Выполнить().Выбрать();
					Пока Выборка.Следующий() Цикл
						МенеджерЗаписи = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьМенеджерЗаписи();
						МенеджерЗаписи.Период = Выборка.Период;
						МенеджерЗаписи.Сделка = ТекущийОбъект.Ссылка;
						МенеджерЗаписи.Партнер = пПартнер;
						МенеджерЗаписи.Удалить();
					КонецЦикла;
				КонецЕсли;	
					
				Запись = НаборЗаписей.Добавить();
				Запись.Период = ТекущийОбъект.Дата;
				Запись.Партнер = пПартнер;
				Запись.Сделка = ТекущийОбъект.Ссылка;
				Запись.ИсточникПервичногоИнтереса = ТекущийОбъект.ИсточникПервичногоИнтереса;
				Запись.КаналПервичногоИнтереса = ТекущийОбъект.КаналПервичногоИнтереса;
			КонецЕсли;
		КонецЕсли;
		
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если Источник.ВладелецФормы <> ЭтаФорма Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.Партнеры") ИЛИ ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров")
		ИЛИ ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.Пользователи") ИЛИ ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Объект.Контакт = НовыйОбъект;
		ОбработкаВыбораКонтакта();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Создан новый партнер" ИЛИ  ИмяСобытия = "Создано новое контактное лицо" ИЛИ  ИмяСобытия = "НовыйПотенциальныйКлиентЗаписан" Тогда
		Объект.Контакт = Параметр;
		ОбработкаВыбораКонтакта();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" элемента формы "Ответственный".
//
Процедура ОтветственныйПриИзменении(Элемент)
	
	Если Объект.Ответственный = Неопределено Тогда
		Объект.Ответственный = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
	
	ВыбранПользователь = (ТипЗнч(Объект.Ответственный) = Тип("СправочникСсылка.Пользователи"));
	
	Если ВыбранПользователь Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
			Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОтветственныйПриИзменении()

&НаКлиенте
Процедура CRM_РольОтветственногоПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.CRM_РольОтветственного) Тогда
		
		Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		
		Элементы.Ответственный.Видимость = Истина;
		Элементы.CRM_РольОтветственного.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИсточникПолученияПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.ИсточникПолучения) Тогда
		Объект.Ответственный = Объект.ИсточникПолучения.ОтветственныйМенеджер;
		Объект.CRM_РольОтветственного = Объект.ИсточникПолучения.CRM_РольОтветственного;
		Элементы.ФормаОтклонитьОбращение.Видимость = Объект.ИсточникПолучения.CRM_ИсточникЛидов;
		Объект.ДополнительныеРеквизиты.Очистить();
		Для Каждого Строка Из Объект.ИсточникПолучения.ДополнительныеРеквизиты Цикл
			Стр = Объект.ДополнительныеРеквизиты.Добавить();
			Стр.Свойство = Строка.Свойство;
		КонецЦикла;	
		Объект.ИсточникПервичногоИнтереса = Объект.ИсточникПолучения.ИсточникПервичногоИнтереса;
		Объект.КаналПервичногоИнтереса = Объект.ИсточникПолучения.КаналПервичногоИнтереса;
	КонецЕсли;
	
	Если Объект.ДополнительныеРеквизиты.Количество() = 0 Тогда
		Элементы.ДополнительныеРеквизиты.Видимость = Ложь;
	Иначе	
		Элементы.ДополнительныеРеквизиты.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПолученияПриИзменении(Элемент)
	ИсточникПолученияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуИнтересаВФормеДокументаНаСервере(ИзмененКлиентКонтакт = Ложь)
	
	CRM_МетодыФормДокументовСервер.ЗаполнитьГруппуИнтересаВФормеДокумента(Объект, ЭтотОбъект, , ИзмененКлиентКонтакт, ТипЗнч(Объект.Ссылка), Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактПриИзменении(Элемент)

	ОбработкаВыбораКонтакта();
	ПерезаполнитьПодсказкуОбАктивныхИнтересах();		

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКонтакта()
	
	Если ЗначениеЗаполнено(Объект.Контакт) И НЕ ТипЗнч(Объект.Контакт) = Тип("Тип") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораКонтактаЗавершение", ЭтотОбъект);
		ЗадатьВопросОСохраненииКИ(Ложь, ОписаниеОповещения);
		Возврат;
	Иначе
		КонтактВладелец = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		Элементы.КонтактВладелец.Видимость = Ложь;
		Партнер = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		ОтображатьКаналИсточник = Ложь;
		//Элементы.ГруппаПервичныйИнтерес.Видимость = ОтображатьКаналИсточник;
	КонецЕсли;
	
	ЗаполнитьГруппуИнтересаВФормеДокументаНаСервере(Истина);
	CRM_МетодыФормДокументовКлиент.УстановитьСвойстваГруппыИнтересВФормеДокумента(ЭтотОбъект);
	
	СформироватьОписаниеКаналаИсточника();
	ДоступностьПервичногоИнтереса();	
	
	Элементы.СоздатьКонтакт.Видимость = Не ЗначениеЗаполнено(Объект.Контакт);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКонтактаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Объект.Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		КонтактВладелец = ПолучитьВладельца(Объект.Контакт);
		Элементы.КонтактВладелец.Видимость = Истина;
	Иначе
		КонтактВладелец = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		Элементы.КонтактВладелец.Видимость = Ложь;
	КонецЕсли;
	
	Если (ТипЗнч(Объект.Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") ИЛИ ТипЗнч(Объект.Контакт) = Тип("СправочникСсылка.Партнеры")) Тогда
		Партнер = ?(ТипЗнч(Объект.Контакт) = Тип("СправочникСсылка.Партнеры"), Объект.Контакт, ПолучитьВладельца(Объект.Контакт));
		ОтображатьКаналИсточник = Истина;
	Иначе
		Партнер = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		ОтображатьКаналИсточник = Ложь;
	КонецЕсли;
	
	//Элементы.ГруппаПервичныйИнтерес.Видимость = ОтображатьКаналИсточник;
	
	ЗаполнитьГруппуИнтересаВФормеДокументаНаСервере(Истина);
	CRM_МетодыФормДокументовКлиент.УстановитьСвойстваГруппыИнтересВФормеДокумента(ЭтотОбъект);
	
	СформироватьОписаниеКаналаИсточника();
	ДоступностьПервичногоИнтереса();
	
	Элементы.СоздатьКонтакт.Видимость = Не ЗначениеЗаполнено(Объект.Контакт);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОСохраненииКИ(ЗаписыватьОбъект, ОповещениеПриЗавершении = Неопределено)
			
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗаписыватьОбъект", ЗаписыватьОбъект);
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	
	АдресСуществует = EMailКонтактаСуществует(Объект.Контакт, Объект.ЭлектроннаяПочта);
	ТелефонСуществует = ТелефонКонтактаСуществует(Объект.Контакт, Объект.Телефон);	
	
	ДобавлятьАдрес = НЕ (АдресСуществует = Неопределено ИЛИ АдресСуществует = Истина);
	ДобавлятьТелефон = НЕ (ТелефонСуществует = Неопределено ИЛИ ТелефонСуществует = Истина);
	
	ДополнительныеПараметры.Вставить("ДобавлятьАдрес", ДобавлятьАдрес);
	ДополнительныеПараметры.Вставить("ДобавлятьТелефон", ДобавлятьТелефон);
	
	Если НЕ (ДобавлятьАдрес ИЛИ ДобавлятьТелефон) Тогда
		ЗадатьВопросОСохраненииКИЗавершение(Неопределено, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	МассивТекстовВопросов = Новый Массив;
	Если ДобавлятьАдрес Тогда		
		ШаблонВопроса = НСтр("ru = 'Сохранить в карточке контакта email: %1?'");
		ТекстВопроса = СтрШаблон(ШаблонВопроса, Объект.ЭлектроннаяПочта);
		МассивТекстовВопросов.Добавить(ТекстВопроса);
	КонецЕсли;
	Если ДобавлятьТелефон Тогда		
		ШаблонВопроса = НСтр("ru = 'Сохранить в карточке контакта телефон: %1?'");
		ТекстВопроса = СтрШаблон(ШаблонВопроса, Объект.Телефон);
		МассивТекстовВопросов.Добавить(ТекстВопроса);
	КонецЕсли;
	
	ТекстВопроса = СтрСоединить(МассивТекстовВопросов, Символы.ПС);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗадатьВопросОСохраненииКИЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОСохраненииКИЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если ДополнительныеПараметры.ДобавлятьАдрес Тогда
			Если НЕ ДобавитьEMailКонтакту(Объект.Контакт, Объект.ЭлектроннаяПочта) Тогда
				Сообщение = НСтр("ru='Для автоматического связывания писем с данным контактом укажите текущий email в его карточке'");
			КонецЕсли;
		КонецЕсли;
		
		Если ДополнительныеПараметры.ДобавлятьТелефон Тогда
			Если НЕ ДобавитьТелефонКонтакту(Объект.Контакт, Объект.Телефон) Тогда
				Сообщение = НСтр("ru='Для автоматического связывания звонков с данным контактом укажите текущий телефон в его карточке'");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, Истина);
	КонецЕсли;
		
	Если ДополнительныеПараметры.ЗаписыватьОбъект Тогда
		Записать();
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура КонтактАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму(ВыбранноеЗначение.ИмяФормы, ВыбранноеЗначение.ПараметрыФормы, ?(ВыбранноеЗначение.РежимВыбора, Элемент, ЭтотОбъект),,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыНового = Новый Структура();
	ПараметрыНового.Вставить("АдресПочты", Объект.ЭлектроннаяПочта);
	ПараметрыНового.Вставить("Телефон", Объект.Телефон);
	ШаблонНаименования = НСтр("ru = '%1, %2'");
	ПараметрыНового.Вставить("Наименование", СтрШаблон(ШаблонНаименования, СокрЛП(Объект.Организация), СокрЛП(Объект.Наименование)));
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора"				,Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе"		,Истина);
	ПараметрыФормыВыбора.Вставить("ПараметрыНового"	,ПараметрыНового);
	
	ДанныеВыбора = Новый СписокЗначений;
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.Партнеры.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Клиенты");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.CRM_ПотенциальныеКлиенты.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Потенциальные клиенты");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.КонтактныеЛицаПартнеров.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Контактные лица");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактВладелецНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, КонтактВладелец);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЛидаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ Элементы.ГруппаСостояниеЛида.Видимость Тогда
		Элементы.ГруппаСостояниеЛида.Видимость = Истина;
		ПодключитьОбработчикОжидания("ВывестиГруппаСостояниеЛида", 0.1, Истина);
		ПодключитьОбработчикОжидания("ЗакрытьГруппаСостояниеЛида", 1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВывестиГруппаСостояниеЛида()
	Элементы.ГруппаСостояниеЛида.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьГруппаСостояниеЛида()
	
	Если Элементы.ГруппаСостояниеЛида.Скрыта() Тогда
		Если Элементы.ГруппаСостояниеЛида.Видимость Тогда
			Элементы.ГруппаСостояниеЛида.Видимость = Ложь;
			ОтключитьОбработчикОжидания("ЗакрытьГруппаСостояниеЛида");
			#Если ВебКлиент Тогда
				ПодключитьОбработчикОжидания("ЗакрытьГруппаСостояниеЛида", 0.1, Истина);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеРеквизиты

&НаКлиенте
Процедура ДополнительныеРеквизитыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыСвойствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	ПараметрыФормы			= Новый Структура("Отбор", Новый Структура("НаборСвойств", ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_CRM_ИсточникиПолученияЛидов")));
	ПараметрыФормы.Вставить("РежимВыбора",			Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",	Истина);
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Позвонить(Команда)
	// +СофтФон
	сфпСофтФонПроКлиентПереопределяемый.сфпПодключаемый_ПозвонитьНаНомер(ЭтотОбъект, Объект);	
	// -СофтФон
КонецПроцедуры

&НаКлиенте
Процедура НаписатьПисьмо(Команда)
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.ЭлектроннаяПочта)) Тогда
		Возврат;
	КонецЕсли;
		
	СписокАдресов = Новый СписокЗначений;
	СписокАдресов.Добавить(Объект.Наименование, Объект.ЭлектроннаяПочта);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СписокАдресов", СписокАдресов);
			
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПринятьОбращение(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заявка", Объект.Ссылка);	
	ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма", ПараметрыФормы,,, ,, ,);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьОбращение(Команда)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		ТекущееСостояние = Неопределено;
		Если CRM_МетодыФормДокументовСервер.ОбращениеНельзяОтклонить(Объект.Ссылка, ТекущееСостояние) Тогда
			CRM_МетодыФормДокументовКлиент.ПоказатьПредупреждениеОбращениеОбработано(ТекущееСостояние);
			Возврат;
		КонецЕсли;
		
		Если УказыватьПричинуОтклонения(Объект.Ссылка) Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОтклонитьОбращениеЗавершение", ЭтотОбъект, Объект.Ссылка);
			ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаПотериОбращения", , ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе	
			ОтклонитьОбращениеЗавершение(Истина, Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьОбращениеЗавершение(Результат, Ссылка) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	
	Иначе
	
		Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("ПричинаОтказа") И ТипЗнч(Результат.ПричинаОтказа) = Тип("СправочникСсылка.CRM_ПричиныОтклоненияОбращений") Тогда
			ОтклонитьОбращениеНаСервере(Ссылка, Результат.ПричинаОтказа, Результат.Комментарий);

		Иначе
			ОтклонитьОбращениеНаСервере(Ссылка, Неопределено, "");
		КонецЕсли;
	
		Объект.CRM_СкрытьВАРМ = Истина;
		Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
			Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		КонецЕсли;
		Записать();

	КонецЕсли;

	Закрыть();

КонецПроцедуры

&НаСервере
Процедура ОтклонитьОбращениеНаСервере(Ссылка, ПричинаОтказа, Комментарий)
	
	Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Ссылка) Тогда
		РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Ссылка, Справочники.CRM_СостоянияЛидов.Отклонен,, ПричинаОтказа, Комментарий); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УказыватьПричинуОтклонения(Ссылка)
	Возврат РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Ссылка, Истина);
КонецФункции

&НаКлиенте
Процедура Подключаемый_СкрытьПоказатьИнтересы(Команда)
	
	Элементы.СкрытьПоказатьИнтересы.Пометка = НЕ Элементы.СкрытьПоказатьИнтересы.Пометка;
	Элементы.ГруппаCRM_ТаблицаИнтересов.Видимость = Элементы.СкрытьПоказатьИнтересы.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОтменитьОтклонение(Команда)
	CRM_МетодыФормДокументовКлиент.ОтменитьОтклонение(Объект.Ссылка, Элементы.ГруппаКомандаОтменитьОтклонение);
	ОбновитьСостояниеОбращения();
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтактВыполнить()

	ПараметрыНового = Новый Структура();
	ПараметрыНового.Вставить("АдресПочты", Объект.ЭлектроннаяПочта);
	ПараметрыНового.Вставить("Телефон", Объект.Телефон);
	ШаблонНаименования = НСтр("ru = '%1, %2'");
	ПараметрыНового.Вставить("Наименование", СтрШаблон(ШаблонНаименования, СокрЛП(Объект.Организация), СокрЛП(Объект.Наименование)));
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПараметрыНового",ПараметрыНового);
	
	СписокИнтерактивноСоздаваемыхКонтактов = Новый СписокЗначений();
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.Партнеры.ФормаОбъекта");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СписокИнтерактивноСоздаваемыхКонтактов.Добавить(СтруктураДанныхВыбора,"Создать 'Клиента'");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.CRM_ПотенциальныеКлиенты.ФормаОбъекта");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СписокИнтерактивноСоздаваемыхКонтактов.Добавить(СтруктураДанныхВыбора,"Создать 'Потенциального клиента'");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаБыстрогоВвода");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СписокИнтерактивноСоздаваемыхКонтактов.Добавить(СтруктураДанныхВыбора,"Создать 'Контактное лицо'");
	
	НовоеОповещение = Новый ОписаниеОповещения("СоздатьКонтактПослеВыбораТипаКонтакта", ЭтотОбъект);
	ПоказатьВыборИзМеню(НовоеОповещение, СписокИнтерактивноСоздаваемыхКонтактов, Элементы.СоздатьКонтакт);
	
КонецПроцедуры // СоздатьКонтактВыполнить()

&НаКлиенте
// Процедура, вызываемая после ответа пользователя по выбору создания типа контакта
// 
// Параметры:
//   Результат 					- ЭлементСпискаЗначений - Тип выбранного контакта для создания
//   ДополнительныеПараметры 	- Структура - Структура с передаваемыми доп. параметрами
//
Процедура СоздатьКонтактПослеВыбораТипаКонтакта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ВыбранноеЗначение = Результат.Значение;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму(ВыбранноеЗначение.ИмяФормы, ВыбранноеЗначение.ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	//Если Результат = Неопределено Тогда
	//	Возврат
	//КонецЕсли;
	//
	//Если Результат.Значение = "КонтактныеЛицаПартнеров" Тогда
	//	ПараметрыФормы = Новый Структура("Основание", Новый Структура("НомерТелефона", Объект.АбонентКакСвязаться));
	//	ИмяФормыВыбора = ".Форма.CRM_ФормаБыстрогоВвода";
	//			
	//ИначеЕсли Результат.Значение = "Партнеры" Тогда
	//	СтруктураПараметрыНового = Новый Структура;
	//	СтруктураПараметрыНового.Вставить("Телефон", Объект.АбонентКакСвязаться);
	//	СтруктураПараметрыНового.Вставить("Наименование" , ?(СтрНайти(Объект.АбонентПредставление, "!!!") = 0, Объект.АбонентПредставление, ""));
	//	ПараметрыФормы = Новый Структура("Основание, ПараметрыНового", Объект.Ссылка, СтруктураПараметрыНового);
	//	ИмяФормыВыбора = ".ФормаОбъекта";
	//Иначе
	//	ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
	//	ИмяФормыВыбора = ".ФормаОбъекта";
	//КонецЕсли;
	//ОткрытьФорму("Справочник." + Результат.Значение + ИмяФормыВыбора, ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НеобходимыеДействияПриСозданииНаСервереЧтенииНаСервере()
	
	Возврат;
	
	// Определить канал и источник первичного интереса.
	Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
		
		Если НЕ Объект.Ссылка.Пустая() Тогда
			Интерес = CRM_МаркетингСервер.ПолучитьПервичныйИнтерес(Объект.Дата, Объект.Ссылка, Партнер);
			
			Объект.КаналПервичногоИнтереса    = Интерес.КаналПервичногоИнтереса;
			Объект.ИсточникПервичногоИнтереса = Интерес.ИсточникПервичногоИнтереса;
			Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Объект.КаналПервичногоИнтереса);
		КонецЕсли;
	Иначе
		Элементы.ГруппаПервичныйИнтерес.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПредыдущийПервичныйИнтересПоПартнеру(ДатаАктуальности)
	
	ПервичныйИнтерес.Очистить();
	ВыводитьНадпись = Ложь;
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		Интерес = CRM_МаркетингСервер.ПолучитьПервичныйИнтерес(Объект.Дата,,Партнер);
		Если ЗначениеЗаполнено(Интерес.КаналПервичногоИнтереса) Тогда
			
			СтрокаПервичногоИнтереса = ПервичныйИнтерес.Вставить(0);
			ЗаполнитьЗначенияСвойств(СтрокаПервичногоИнтереса,Интерес);
			СтрокаПервичногоИнтереса.Актуальность = Истина;
			
			Если ТипЗнч(Интерес.КаналПервичногоИнтереса.ТипЗначения.ПривестиЗначение()) = Тип("СправочникСсылка.МаркетинговыеМероприятия") 
			   И ЗначениеЗаполнено(Интерес.ИсточникПервичногоИнтереса) Тогда
				СтрокаПервичногоИнтереса.Актуальность = Интерес.ИсточникПервичногоИнтереса.CRM_ДатаАктуальности >= НачалоДня(Объект.Дата);
				ДатаАктуальности = Интерес.ИсточникПервичногоИнтереса.CRM_ДатаАктуальности;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОписаниеКаналаИсточника()
	
	Возврат;
	
	Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
		
		КаналПервичногоИнтереса = Неопределено;
		ИсточникПервичногоИнтереса = Неопределено;
		
		Элементы.РанееЗарегистрированныйИнтерес.Видимость = ЗначениеЗаполнено(Партнер);
		
		ПервичныйИнтерес.Очистить();		
		ВыводитьНадпись = Ложь;
		
		Если ЗначениеЗаполнено(Партнер) Тогда
			
			АктуальноДо = '00010101';
			ПолучитьПредыдущийПервичныйИнтересПоПартнеру(АктуальноДо);
			
			Интерес = Неопределено;
			Попытка
				
				Интерес = ПервичныйИнтерес.Получить(0);
				
			Исключение	КонецПопытки;
			
			РанееНеЗарегистровано = Ложь;
			Если Интерес <> Неопределено И ЗначениеЗаполнено(Интерес.КаналПервичногоИнтереса) Тогда
				ВыводитьНадпись = Истина;
					Надпись = "";
					CRM_МаркетингСервер.СформироватьНадписьПервичногоИнтереса(Объект.Ссылка, Интерес, АктуальноДо, Надпись, ВыводитьНадпись);
					Элементы.РанееЗарегистрированныйИнтерес.Заголовок = Надпись;
			КонецЕсли;
			
			Элементы.РанееЗарегистрированныйИнтерес.Видимость = ВыводитьНадпись;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьПервичногоИнтереса()
	
	Возврат;
	
	Актуальность = Ложь;
	ПредыдущийИсточник = Неопределено;
	Попытка
		ПредыдущийИсточник = ПервичныйИнтерес.Получить(0);
	Исключение КонецПопытки;
	Если ПредыдущийИсточник <> Неопределено Тогда
		
		Актуальность = ПредыдущийИсточник.Актуальность;
		
	КонецЕсли;
	
	пПартнер = Партнер;
	
	НаличиеУчастников = ?(ЗначениеЗаполнено(пПартнер),Истина,Ложь);
	
	Если НаличиеУчастников Тогда
		Элементы.КаналПервичногоИнтереса.Доступность = Истина;
		Элементы.КаналПервичногоИнтереса.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.КаналПервичногоИнтереса.Доступность = Ложь;
		Элементы.КаналПервичногоИнтереса.ТолькоПросмотр = Истина;
		Элементы.ИсточникПервичногоИнтереса.Доступность = Ложь;
		Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КаналПервичногоИнтереса) 
		И ТипПВХ(Объект.КаналПервичногоИнтереса) <> Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника") Тогда
		Элементы.ИсточникПервичногоИнтереса.Доступность = Истина;
		Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ИсточникПервичногоИнтереса.Доступность = Ложь;
		Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// Отметки незаполненного
	Если Актуальность = Истина И Не ЗначениеЗаполнено(Объект.КаналПервичногоИнтереса) Тогда
		Элементы.КаналПервичногоИнтереса.АвтоОтметкаНезаполненного = Ложь;
		Элементы.КаналПервичногоИнтереса.ОтметкаНезаполненного = Ложь;
	ИначеЕсли Актуальность = Ложь 
		И Не ЗначениеЗаполнено(Объект.КаналПервичногоИнтереса) Тогда
		// Если обязательно заполнять актуальный источник привлечения, тогда подсвечиваем канал актуального источника
		// привлечения.
		Если ЗаполнятьПервичныйИнтерес Тогда
			
			Элементы.КаналПервичногоИнтереса.АвтоОтметкаНезаполненного = Истина;
			Элементы.КаналПервичногоИнтереса.ОтметкаНезаполненного = Истина;
			
		Иначе
			
			Элементы.КаналПервичногоИнтереса.АвтоОтметкаНезаполненного = Ложь;
			Элементы.КаналПервичногоИнтереса.ОтметкаНезаполненного = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.ИсточникПервичногоИнтереса.Доступность = Истина 
		// И ЗаполнятьПервичныйИнтерес 
		И Не ЗначениеЗаполнено(Объект.ИсточникПервичногоИнтереса) Тогда
		Элементы.ИсточникПервичногоИнтереса.АвтоОтметкаНезаполненного = Истина;
		Элементы.ИсточникПервичногоИнтереса.ОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КаналПервичногоИнтереса) 
		И ТипПВХ(Объект.КаналПервичногоИнтереса) = Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника") Тогда
		Элементы.ИсточникПервичногоИнтереса.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ИсточникПервичногоИнтереса.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПодсказкуОбАктивныхИнтересах()
	CRM_МетодыФормДокументовСервер.ЗаполнитьНадписьВСтрокеИнтереса(ЭтотОбъект, Объект);	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипПВХ(ПВХСсылка)
	Возврат ТипЗнч(ПВХСсылка.ТипЗначения.ПривестиЗначение());
КонецФункции

&НаСервере
Функция ТелефонКонтактаСуществует(Контакт, Телефон)
	
	Если НЕ ЗначениеЗаполнено(Контакт) Тогда
		Возврат Неопределено;
	ИначеЕсли ПустаяСтрока(Контакт) Тогда
		Возврат Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(Телефон) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КИСуществует = Ложь;
	
	Для Каждого СтрокаКИ Из Контакт.КонтактнаяИнформация Цикл
		
		Если НЕ (СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон) Тогда
			Продолжить;
		Иначе
			СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(СтрокаКИ.Представление);
			ТелефонКИ = сфпСофтФонПроСервер.сфпПреобразоватьНомерСУчетомПрефиксов(СтруктураНомера);
			Если ТелефонКИ = Телефон Тогда	
				КИСуществует = Истина;
			Прервать;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КИСуществует;
	
КонецФункции

&НаСервереБезКонтекста
Функция УбратьРазделителиВНомерТелефона(Знач НомерТелефона)
	Поз = Найти(НомерТелефона, ",");
	Если Поз <> 0 Тогда
		НомерТелефона = Лев(НомерТелефона, Поз-1);
	КонецЕсли;
	
	НомерТелефона = СтрЗаменить(НомерТелефона, "-", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, " ", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "+", "");

	Возврат НомерТелефона;
КонецФункции

&НаСервере
Функция ДобавитьТелефонКонтакту(Контакт, Телефон)
	
	КИСуществует = ТелефонКонтактаСуществует(Контакт, Телефон);
	
	Если КИСуществует = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли КИСуществует Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.Пользователи") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	КонтактОбъект = Контакт.ПолучитьОбъект();
	НоваяСтрока = КонтактОбъект.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Вид	= ВидКИ;
	НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	
	СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Телефон);
	НоваяСтрока.Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, "","");
	НоваяСтрока.Значение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(НоваяСтрока.Представление, НоваяСтрока.Вид);
	НоваяСтрока.НомерТелефонаБезКодов = УбратьРазделителиВНомерТелефона(СтруктураТелефона.НомерТелефона);
	НоваяСтрока.НомерТелефона         = УбратьРазделителиВНомерТелефона(СтруктураТелефона.КодСтраны + СтруктураТелефона.КодГорода + СтруктураТелефона.НомерТелефона);
	НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяСтрока.Значение, НоваяСтрока.Представление, НоваяСтрока.Вид);
		
	АдресЗаписан = Истина;
	
	Попытка
		КонтактОбъект.Записать();
	Исключение
		АдресЗаписан = Ложь;
	КонецПопытки;
	
	Возврат АдресЗаписан;
	
КонецФункции

&НаСервере
Функция EMailКонтактаСуществует(Контакт, EMail)
	
	Если НЕ ЗначениеЗаполнено(Контакт) Тогда
		Возврат Неопределено;
	ИначеЕсли ПустаяСтрока(Контакт) Тогда
		Возврат Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(EMail) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	АдресСуществует = Ложь;
	
	Для Каждого СтрокаКИ Из Контакт.КонтактнаяИнформация Цикл
		
		Если НЕ (СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) Тогда
			Продолжить;
		ИначеЕсли СтрокаКИ.Представление = EMail Тогда	
			АдресСуществует = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат АдресСуществует;
	
КонецФункции

&НаСервере
// Функция добавляет адрес электронной почты выбранному контакту.
//
// Параметры:
//	Контакт	- СправочникСсылка	- Контакт
//	EMail	- Строка			- Адрес электронной почты.
//
// Возвращаемое значение:
//	Булево	- Результат добавления.
//
Функция ДобавитьEMailКонтакту(Контакт, EMail)
	
	АдресСуществует = EMailКонтактаСуществует(Контакт, EMail);
	
	Если АдресСуществует = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли АдресСуществует Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.EmailПартнера;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.Пользователи") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.EmailПользователя;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	КонтактОбъект = Контакт.ПолучитьОбъект();
	НоваяСтрока = КонтактОбъект.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Вид	= ВидКИ;
	НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	
	НоваяСтрока.Представление	= EMail;
	НоваяСтрока.АдресЭП			= EMail;
	Поз = Найти(EMail, "@");
	Если Поз > 0 Тогда
		НоваяСтрока.ДоменноеИмяСервера = Сред(EMail, Поз + 1);
	КонецЕсли;
	
	НоваяСтрока.Значение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(EMail, НоваяСтрока.Вид);
	НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяСтрока.Значение, НоваяСтрока.Представление, НоваяСтрока.Вид);
	
	АдресЗаписан = Истина;
	Попытка
		КонтактОбъект.Записать();
	Исключение
		АдресЗаписан = Ложь;
	КонецПопытки;	
	Возврат АдресЗаписан;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВладельца(КонтактноеЛицо)
	
	Возврат КонтактноеЛицо.Владелец;
	
КонецФункции

&НаСервере
Функция МассивЭлементовСостоянияОбращения()
	
	МассивЭлементов = Новый Массив;
	
	МассивЭлементов.Добавить(Элементы.ГруппаСостояниеЛида);
	МассивЭлементов.Добавить(Элементы.ПричинаОтклонения);
	МассивЭлементов.Добавить(Элементы.КомментарийСостоянияЛида);
	МассивЭлементов.Добавить(Элементы.ЛидСконвертированВОбъект);
	МассивЭлементов.Добавить(Элементы.ФормаОтклонитьОбращение);

	Возврат МассивЭлементов;
	
КонецФункции

&НаСервере
Процедура ОбновитьСостояниеОбращения()
	
	// Установка значений по умолчанию:
	СостояниеЛида 			 = Неопределено;
	ПричинаОтклоненияЛида 	 = Неопределено;
	КомментарийСостоянияЛида = Неопределено;
	ЛидСконвертированВОбъект = Неопределено;
	
	CRM_МетодыФормДокументовСервер.ВосстановитьНастройкиЭлементовСостоянияОбращения(АдресНастройкиЭлементовСостоянияОбращения,
																					МассивЭлементовСостоянияОбращения());

	Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Объект.Ссылка) Тогда
		СтруктураСостоянияЛида = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛида(Объект.Ссылка);
		Если СтруктураСостоянияЛида = Неопределено Тогда
			Элементы.СостояниеЛида.Гиперссылка = Ложь;
		Иначе
			СостояниеЛида = СтруктураСостоянияЛида.Состояние;
			Если СостояниеЛида <> Справочники.CRM_СостоянияЛидов.Новый И СостояниеЛида.Предопределенный Тогда
				Элементы.ФормаОтклонитьОбращение.Доступность = Ложь;
			КонецЕсли;
			
			Если СостояниеЛида = Справочники.CRM_СостоянияЛидов.Отклонен Тогда
				Элементы.СостояниеЛида.Гиперссылка = Истина;
				ПричинаОтклоненияЛида = СтруктураСостоянияЛида.ПричинаОтклонения;
				КомментарийСостоянияЛида = СтруктураСостоянияЛида.Комментарий;
				Элементы.СостояниеЛида.Подсказка = "Причина: " + ПричинаОтклоненияЛида + Символы.ПС +
												   "Комментарий: " + КомментарийСостоянияЛида;
				CRM_МетодыФормДокументовСервер.ДобавитьКомандуОтменитьОтклонение(ЭтаФорма, Элементы.ГруппаКомандаОтменитьОтклонение);
			Иначе
				ЛидСконвертированВОбъект = СтруктураСостоянияЛида.СконвертированВОбъект;
				Элементы.ЛидСконвертированВОбъект.Видимость = ЗначениеЗаполнено(ЛидСконвертированВОбъект);
				Элементы.СостояниеЛида.Гиперссылка = ЗначениеЗаполнено(ЛидСконвертированВОбъект);
				Элементы.ПричинаОтклонения.Видимость = Ложь;
				Элементы.КомментарийСостоянияЛида.Видимость = Ложь;
			КонецЕсли;
			
			ОбновитьДатуОбработкиОбращения(СтруктураСостоянияЛида.ДатаОбработки);
			
		КонецЕсли;
	Иначе
		Элементы.СостояниеЛида.Гиперссылка = Ложь;
		Элементы.ФормаОтклонитьОбращение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДатуОбработкиОбращения(ДатаОбработки)
	
	ШаблонЗаголовка = НСтр("ru = 'Дата обработки: %1'; en = 'Processing Date: %1'");
	Элементы.ДатаОбработкиОбращения.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, Формат(ДатаОбработки,"ДФ='dd.MM.yyyy HH:mm'"));
	Элементы.ДатаОбработкиОбращения.Видимость = ЗначениеЗаполнено(ДатаОбработки);
	
КонецПроцедуры

#КонецОбласти
